{
	"_meta": {
		"sources": [
			{
				"json": "NagaHB",
				"abbreviation": "MHB",
				"full": "Nagavarii Species",
				"authors": [
					"Marrix"
				],
				"version": "1.0",
				"url": "",
				"color": "674f35"
			}
		]
	},
	"race": [
		{
			"name": "Nagavarii",
			"source": "NagaHB",
			"__prop": "race",
			"ability": [
				{
					"choose": {
						"weighted": {
							"from": [
								"str",
								"dex",
								"con",
								"int",
								"wis",
								"cha"
							],
							"weights": [
								2,
								1
							]
						}
					}
				},
				{
					"choose": {
						"weighted": {
							"from": [
								"str",
								"dex",
								"con",
								"int",
								"wis",
								"cha"
							],
							"weights": [
								1,
								1,
								1
							]
						}
					}
				}
			],
			"creatureTypes": [
				"fey"
			],
			"size": [
				"S",
				"M"
			],
			"speed": {
				"walk": 30,
				"climb": true
			},
			"skillProficiencies": [
				{
					"choose": {
						"from": [
							"acrobatics",
							"arcana",
							"athletics",
							"perception",
							"stealth",
							"survival"
						],
						"count": 2
					}
				}
			],
			"entries": [
				{
					"name": "Size",
					"entries": [
						"You are Medium or Small. You choose the size when you select this race."
					]
				},
				{
					"name": "Creature Type",
					"entries": [
						"You are a Fey."
					]
				},
				{
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
					]
				},
				{
					"name": "Natural Armor",
					"entries": [
						"You have tough, scaly skin. When you aren't wearing armor, your base AC is 13 + Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC."
					]
				},
				{
					"name": "Serpent's Intuition",
					"entries": [
						"You gain proficiency in two of the following skills of your choice: {@skill Acrobatics}, {@skill Arcana}, {@skill Athletics}, {@skill Perception}, {@skill Stealth}, or {@skill Survival}."
					]
				},
				{
					"name": "Serpentine Form",
					"entries": [
						"Your limbless, serpentine body affects how you interact with your environment:",
						{
							"type": "list",
							"items": [
								"You cannot wear armor unless it is made to fit your unique form."
							]
						},
						{
							"type": "list",
							"items": [
								"You can wield one-handed weapons, shields, and tools, or manipulate objects using your tail."
							]
						},
						{
							"type": "list",
							"items": [
								"You can perform somatic components using movements of your body. During this, the gem on your head softly glows."
							]
						},
						{
							"type": "list",
							"items": [
								"You can grapple one creature at a time by coiling your body around it. This does not prevent you from using weapons or other objects with your tail."
							]
						}
					]
				},
				{
					"name": "Slithering Agility",
					"entries": [
						"Moving while {@condition prone} costs you no extra movement, and standing up from {@condition prone} costs you only 5 feet of movement. Additionally, you have a climbing speed equal to your walking speed."
					]
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write {@language Common} and {@language Sylvan}."
					]
				}
			],
			"fluff": {
				"images": [
				],
				"entries": [
					"The Nagavarii are serpentine fey born from the feywilds deep jungles and shimmering pools. They have colorful, tough scales, with a softly glowing gem atop their foreheads marking their connection to the feywilds magic.",
					"Known for subtlety and cunning, the Nagavarii use their tails to wield weapons and tools with great precision. They are famed for stealing and hoarding magical artifacts, which they can drain of their magic to lengthen their lifespans.",
					"Most Nagavarii remain in the feywilds hidden places, but over time some tribes have ventured into the primal plane, carrying their secrets beyond the feywild."
					]
				},
				"languageProficiencies": [
				{
					"common": true,
					"sylvan": true
				}
			]
		}
	]
}